#include <stdio.h>
#include <locale.h>
#include "windows.h"
#define _CRT_SECURE_NO_WARNINGS

int main(void) {
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	setlocale(LC_ALL, "Russian");

	char name1[9], name2[7], name3[10];
	char cod1, cod2, cod3;
	float m1, m2, m3;
	char pl1, pl2, pl3;
	/* введение фактических данных*/
	printf("1. введите: фамилию участника, код команды, количестов, место в итоге >");
	scanf_s("%s %c %f %d", name1, &cod1, &m1, &pl1);
	printf("2. введите: фамилию участника, код команды, количестов, место в итоге >");
	scanf_s("%s %c %f %d", name2, &cod2, &m2, &pl2);
	printf("3. введите: фамилию участника, код команды, количестов, место в итоге >");
	scanf_s("%s %c %f %d", name3, &cod3, &m3, &pl3);
	/* Вывод таблицы 

	char name1[9]= "Баландин", name2[7]= "Шишков", name3[10]="Кравченко";
	char cod1 ='C', cod2='Ш', cod3='Д';
	float m1 = 123.7, m2 = 79.98, m3 = 134.8;
	char pl1='2', pl2='3', pl3='1';
	
	/* вывод заголовков */
	printf("|-----------------------------------------------------------|\n");
	printf("|               Ведомость спортивных сотязаний              |\n");
	printf("|-----------------------------------------------------------|\n");
	printf("| Фамилия участника | Код команды | Количество|Места в итоге|\n");
	printf("|                   |             |    баллов |             |\n");
	printf("|-------------------|-------------|-----------|-------------|\n");
	/* вывод строк фактических данных */
		, name1, cod1, m1, pl1);
	printf("|%-9s          |%-c            |%-3.2f      |%-1c            |\n", name2, cod2, m2, pl2);
	printf("|%-10s         |%-c            |%-3.1f      |%-1c            |\n", name3, cod3, m3, pl3);
	/* вывод примечаний */
	printf("|-----------------------------------------------------------|\n");
	printf("| Примечание: Ш - Шахтер; С - Спартак;                      |\n");
	printf("|             Д - Динамо                                    |\n");
	printf("|-----------------------------------------------------------|\n");

	return 1;
}
