#include <stdio.h>
#include <math.h>
#include <locale.h>
int main(void) {
	setlocale(LC_ALL, "rus");
	short n;        /* параметр внешнего цикла */
	double x, y;    /* абсцисса и ордината графика */
	short h;
	char ch;

	/* позиция точки на экране */
	   /* внешний цикл - для 5 периодов */
	for (n = 0; n < 5; n++) {
		/* вывод заголовка таблицы */
		printf("|   x   |      y     |\n");
		printf("|-------|------------|\n");
		/* внутренний цикл для одного периода */

		for (x = 0; x < 4; x += 0.25) {
			if (x == 2 ) {
				printf("| %5.2lf | %10.7lf |", x + n * 4., y);
				/* определение позиции точки */
				h = ((y + 1) * 10) - 10;
				if ((y + 1) * 10. - h > 0.5) h++;
				for (int i = 0; i < 10; i++) printf(" ");
				/* вывод точки графика */
				for (; h > 0; h--) printf("*");
				printf("*\n");
			}
			else if (x == 3) {
				printf("| %5.2lf | %10.7lf |", x + n * 4., y);
				/* определение позиции точки */
				h = (y + 1) * 10 ;
				/* вывод точки графика */
				for (; h < 10; h++) printf("*");
				printf("*\n");

			}
			else {
				if (x < 2) {
					y = sqrt((2. * 2.) - ((x - 2) * (x - 2)));

				}

				else if (x < 3) y = -sqrt(1 - (x - 3) * (x - 3));
				else  y = 0.;

				printf("| %5.2lf | %10.7lf |", x + n * 4., y);
				/* определение позиции точки */
				h = (y + 1) * 10;
				if ((y + 1) * 10. - h > 0.5) h++;

				/* вывод точки графика */
				for (; h > 0; h--) printf(" ");
				printf("*\n");
			}


		}  /* конец внутреннего цикла */
	  /* пауза до команды оператора */
		printf("Нажмите клавишу Enter...");
		ch = getchar();
	}  /* конец внешнего цикла */
	return 0;
} /* конец программы */